---
type: Line
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# Line

`Autodesk.Revit.DB.Line` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateBound | 2014 | `public static Line CreateBound ( XYZ endpoint1 , XYZ endpoint2 )` |
| Method | CreateUnbound | 2014 | `public static Line CreateUnbound ( XYZ origin , XYZ direction )` |
| Method | Intersect | — | `` |
| Method | IsInside | — | `` |
| Property | Direction | — | `public XYZ Direction { get ; }` |
| Property | Origin | — | `public XYZ Origin { get ; }` |